#include "../mainwindow.h"

void MainWindow::on_action_triggered()
{
    QMessageBox::about(
        this, "Про мову цього емулятора",
        "<h4>Синтаксис:</h4>"

        "В мові елементарною одиницею є рядок, який завжди має вид: <br> "
        "statement1, word1->statement2, word2, direction <br>"
        "У зовньошньому алфавіті допустимі лише латинські літери будь-якого регістру, цифри та нижні "
        "підкреслення \"_\". У внутрьошньому алфавіті букви і цифри, а також такі спецсимволи: "
        "+,-,/,*,=,:,^,#,!,?,&,,%,_ , знаки більше та менше (але без коми!).<br>"
        "Мова не має обмежень у довжині ідентификаторів і рядків та не залежить від кількости чи наявності відступів, "
        "табуляцій, пропусків."

        "<h4>Секції:</h4>"
        "За прикладом мов асемблерів, мова данного емулятора розділена на секції <br>"
        "'section .text' це секція тексту програми і 'section .data' секція початкових даних<br>"
        "У програмі може існувати декілька секцій одного типу. З '.data' обирається остання, всі секції"
        "'.text' зливаються в одну."

        "<h4>Макроси:</h4>Макроси подібні до таких у мові С: <br>#define st1 st2<br>Тут st1 заміниться на st2. "
        "Макроси підставляються по черзі їх оголошення зверху вниз."

        "<h4>section .data:</h4>Кожна клітинка стрічки має довільну довжину та відділяється від інших пропуском \" "
        "\", "
        "клітинка під курсором виділяється за допомогою \"|\", приклад:<br>|lambda|"

        "<h4>Коментарі:</h4>За ассемблерним стилем коментарі мають лише однорядковий синтаксис та діють з "
        "\";\" до кінця рядка:<br>"
        "код ;  коментар"

        "<h4>Про виконання програми:</h4>"
        "Виконання завжди починається зі стану \"start\" та слова, що було виділено "
        "курсором, кінцевий стан - \"end\", lambda - зарезервоване слово, що позначає пустий символ. <br><br>"

        "Детальні матеріали, приклади і контакти для запитань є на сайті проекту:"
        "<div><a href=\"https://kaifolog.github.io/TME-website/\" "
        "style=\"color:#0057b7\">https://kaifolog.github.io/TME-website/</a>");
}
void MainWindow::on_action_2_triggered()
{
    QMessageBox::about(this, "Гарячі клавіші.",
                       "Ctrl+S - Save file<br>"
                       "Ctrl+N - New file<br>"
                       "Ctrl+O - Open file<br>"
                       "Ctrl+Shift+X - Quick start<br>"
                       "Ctrl+Tab - підстановка роздільників команди до вигляду \",->,,\"<br><br>"
                       "F5 - один крок дебагера<br>"

                       "Детальні матеріали і контакти для запитань є на сайті проекту:"
                       "<div><a href=\"https://kaifolog.github.io/TME-website/\" "
                       "style=\"color:#0057b7\">https://kaifolog.github.io/TME-website/</a>");
}

void MainWindow::on_action_3_triggered()
{
    QMessageBox::about(this, "Приклад програми.",
                       "Виконаємо порт з Оніщенка:<br>"
                       "#define ,: ,lambda: ; на нашому емуляторі недопустимі пусті строки<br>"
                       "#define ,, ,lambda, ; на нашому компіляторі недопустимі пусті строки<br>"
                       "#define q0 start ; змінюємо точку входу<br>"
                       "#define ! end ; змінюємо точку кінця<br>"
                       "#define * star ; <br>"
                       "#define : -> ; <br>"
                       "section .data<br>"
                       "|lambda|<br>"
                       "section .text<br>"
                       "q0,:q1,g,r<br>"
                       "q1,:q2,e,r<br>"
                       "q2,:q3,o,r<br>"
                       "q3,:q4,r,r<br>"
                       "q4,:q5,g,r<br>"
                       "q5,:q6,e,r<br>"
                       "q6,:!,,r<br><br>"
                       "Більше прикладів і контакти для запитань є на сайті проекту:"
                       "<div><a href=\"https://kaifolog.github.io/TME-website/\" "
                       "style=\"color:#0057b7\">https://kaifolog.github.io/TME-website/</a>");
}

void MainWindow::on_action_5_triggered()
{
    QMessageBox::about(
        this, "Про інтерфейс емулятора",
        "Інтерфейс емулятора дуже простий. Якщо ви це читаєте, то з панеллю іструментів ви вже знайомі. <br>"
        "Загалом інтерфейс складається з головного текстового поля, у якому необхідно, після відкриття або створення "
        "файла, набрати свою програму; після використання лівого чекбоксу - найвища секція даних перенесеться на "
        "найвище поле вводу; після натискання правого чекбоксу, всі \"lambda\" у полі з результатом будуть замінені на "
        "\" \"."
        "Кнопка Quick start запускає парсер і емулятор, або простими словами - обробляє та запускає вашу програму. "
        "Дебагер працює аналогічно з будь-якою популярною IDE: після розстанов точок зупину (\";d\"), або без них, "
        " треба запустити дебагер та користуючись лівим меню переходити між точками, або виконувати програму "
        "покроково.<br><br>"

        "Детальніше про емулятор і контакти для запитань є на сайті проекту:"
        "<div><a href=\"https://kaifolog.github.io/TME-website/\" "
        "style=\"color:#0057b7\">https://kaifolog.github.io/TME-website/</a>");
}

void MainWindow::on_actionAbout_program_triggered()
{
    QMessageBox::about(
        this, "About",

        "<h4>Присвячено всім моїм друзям і подругам, всім людям доброї волі та всьому українському народові. <br>"
        "<p>Хочеш допомогти? Стикнувся з проблемами при використанні? Маєш цікаві пропозиції не "
        "пов'язані з цим проектом? </p>"
        "<p>Контакти та все інше можна знайти на сайті проекту:</p>"

        "<div><a href=\"https://kaifolog.github.io/TME-website/\" "
        "style=\"color:#0057b7\">https://kaifolog.github.io/TME-website/</a> </h4>");
}

void MainWindow::on_actionSettings_triggered()
{
    NORMALMIDDLEWARE

    SettingsWindow settingswindow(this->app, this);
    settingswindow.exec();
}